{
  "about": {
    "data": {
      "display_name": "ethereum",
      "public_description": "Next-generation platform for decentralised applications.\n\nDive in at ethereum.org",
      "header_title": "Ethereum",
      "subscribers": 2502199,
      "active_user_count": 475,
      "icon_img": "https://a.thumbs.redditmedia.com/VOMC0qXTimvcO1mV4LbjfrV8yH2qJRsSx3rpGvpXBP0.png",
      "header_img": "https://b.thumbs.redditmedia.com/QPWBJVeSoUDcA1Sc3dYL7eK_3bq2ZdVbOxNOdcBojNM.png"
    }
  },
  "posts": {
    "data": {
      "children": [
        {
          "data": {
            "id": "16fni9i",
            "selftext": "**Welcome to the Weekly Discussion. Please read the disclaimer, guidelines, and rules before participating.**\n\nRules:\n\n* All [sub rules](https://www.reddit.com/r/Ethereum/about/rules/) apply in this thread.\n* Discussion topics must be related to Ethereum.\n* Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n* Comments will be sorted by newest first.\n\nUseful Links:\n\n* [Ethereum.org](https://ethereum.org)\n* [ETHMerge.com](https://ethmerge.com/)\n\n**Reminder**\n\n/r/ethereum is a community for discussing the technology, news, applications and community of Ethereum. **Discussion of the Ether price or trading is not allowed.** Please keep those discussions to [/r/ethfinance](https://www.reddit.com/r/ethfinance) and [/r/ethstaker](https://www.reddit.com/r/ethstaker).\n\n\u0026amp;#x200B;\n\n**Frequently Asked Questions**\n\n**Where's the best place to buy ETH?**\n\nThere are many centralized exchanges that support Ethereum. If you live in the US, the most popular exchanges are Coinbase, Gemeni and Kraken. Coinbase users can use Coinbase Pro for lower fees.\n\n**How can I stake my ETH?**\n\nThe best way to stake your ETH: by running your own validator.\n\n* Running your own validator requires a modern computer and 32 ETH. Visit /r/ethstaker for more details\n\n**Why are Ethereum transaction fees so high?**\n\nLike most blockchains, Ethereum fees are determined by supply-and-demand. The large demand to use Ethereum has pushed transaction fees quite high (however, fees were just a few cents only 2 years ago). Fees are especially high during market volatility, and during NFT drops.\n\n**What is being done to lower Ethereum transaction fees?**\n\nEthereum fees are reduced by using layer-2 rollups. Rollups are scaling solutions that allow for significantly cheaper transactions, while still maintaining Ethereum's security.\n\nAdditionally, data shards will make rollups even cheaper.\n\nWhile rollups are cutting-edge technology being actively developed, a number are already live on Ethereum mainnet. Visit [l2beat.com](https://l2beat.com/) to learn more about rollups.\n\n**What's the best wallet for Ethereum?**\n\nThe most popular tool for using decentralized applications is Metamask. However, for security reasons, we recommend using a hardware wallet such as a Trezor or Ledger.\n\n\u0026amp;#x200B;\n\nAre there questions you'd like to see added? Leave a comment below.",
            "author": "AutoModerator",
            "title": "Frequently Asked Questions + Weekly Discussion Thread",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 10,
            "created": 1694412077.0,
            "num_comments": 3,
            "url": "https://www.reddit.com/r/ethereum/comments/16fni9i/frequently_asked_questions_weekly_discussion/",
            "permalink": "/r/ethereum/comments/16fni9i/frequently_asked_questions_weekly_discussion/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jumvd",
            "selftext": "",
            "author": "abcoathup",
            "title": "Latest Week in Ethereum News",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 25,
            "created": 1694827123.0,
            "num_comments": 4,
            "url": "https://weekinethereumnews.com/week-in-ethereum-news-september-16-2023",
            "permalink": "/r/ethereum/comments/16jumvd/latest_week_in_ethereum_news/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jkoq2",
            "selftext": "",
            "author": "bored_cs_student",
            "title": "Browsing for Bugs: Finding and Reporting a $3M Bug in Premia Finance",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 35,
            "created": 1694801881.0,
            "num_comments": 2,
            "url": "https://www.zellic.io/blog/browsing-for-bugs-3m-bug-in-premia-finance",
            "permalink": "/r/ethereum/comments/16jkoq2/browsing_for_bugs_finding_and_reporting_a_3m_bug/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jpblt",
            "selftext": "I’m looking to understand if a non dev defi usar have already done a flash loan trading transaction and how was your experience with it? \n\nHow did you do it? Did you make any money?",
            "author": "jamesallen18181",
            "title": "Hello ethereum community! Have you already done a flash loan trading transaction as a non dev?",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 12,
            "created": 1694813007.0,
            "num_comments": 20,
            "url": "https://www.reddit.com/r/ethereum/comments/16jpblt/hello_ethereum_community_have_you_already_done_a/",
            "permalink": "/r/ethereum/comments/16jpblt/hello_ethereum_community_have_you_already_done_a/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jgvzo",
            "selftext": "",
            "author": "zacchj",
            "title": "fhEVM: Confidential EVM Smart Contracts using Fully Homomorphic Encryption",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 17,
            "created": 1694792745.0,
            "num_comments": 2,
            "url": "https://www.meetup.com/fhe-org/events/296075055/",
            "permalink": "/r/ethereum/comments/16jgvzo/fhevm_confidential_evm_smart_contracts_using/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16j6yro",
            "selftext": "**Deflationary coin**\n\nWhen it was a Proof of Wook blockchain, the ETH inflation rate was 3.15%/year. But within a year after The Merge:\n\n* 679,000 ETH released\n* 981,000 ETH burned\n* Total: -302,000 ETH\n\n**Ushering in the era of Liquid Staking**\n\nProof-of-Stake brings the long-awaited staking feature to ETH. According to data from DefiLlama, there is $19.5 billion in ETH staked in current protocols, with Lido Finance accounting for 72% of the market share.\n\n**Consumes less energy**\n\nAccording to data from The Cambridge Center for Alternative Finance, the amount of electricity used by the Ethereum network decreased by 99.9% after The Merge.\n\nIn times of downtrend like this, is ETH everyone's priority choice? For me, $ETH and $RBIF are my two priority choices at this time. I will not sell them for any reason, if the price drops I will continue to buy more. What about everyone?",
            "author": "Frosty_Pop_7617",
            "title": "1 year in review: Ethereum after The Merge",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 67,
            "created": 1694764129.0,
            "num_comments": 44,
            "url": "https://www.reddit.com/r/ethereum/comments/16j6yro/1_year_in_review_ethereum_after_the_merge/",
            "permalink": "/r/ethereum/comments/16j6yro/1_year_in_review_ethereum_after_the_merge/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jgziv",
            "selftext": "There are 18 wallet providers currently won the ethereum foundation grant for ERC-4337 implementation.\n\nThese are _ \n\n-Zero Dev Kernel . \n-Etherspot. \n-MynaWallet. \n-Blocto. \n-Silius. \n-Ambire. \n-ioTeX. \n-SixDegreeLab. \n-Jam. \n-Rhinestone. \n-Tokensight. \n-Unipass. \n-Clave. \n\nI only heard about details of erc-4337 today and have to admit even though its not 100% align with our going all the way to self-custody, its pretty easy to common folks to get into wallets and cryptos. \n\nSo are you guys watching on erc-4337 wallets ? \n\nAnd tokens of those wallets for buying ? \n\ncheers.",
            "author": "garysei124",
            "title": "Anyone watching ERC-4337 Wallets ?",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 11,
            "created": 1694792965.0,
            "num_comments": 12,
            "url": "https://www.reddit.com/r/ethereum/comments/16jgziv/anyone_watching_erc4337_wallets/",
            "permalink": "/r/ethereum/comments/16jgziv/anyone_watching_erc4337_wallets/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jci9v",
            "selftext": "",
            "author": "mudgen",
            "title": "OpenZeppelin has adopted Diamond Storage for its upgradeable smart contracts, which means in theory they are now compatible with EIP-2535 Diamonds.",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 14,
            "created": 1694782159.0,
            "num_comments": 0,
            "url": "https://github.com/OpenZeppelin/openzeppelin-contracts/pull/4534",
            "permalink": "/r/ethereum/comments/16jci9v/openzeppelin_has_adopted_diamond_storage_for_its/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jcrnv",
            "selftext": "i'm following significant accounts on alternative platforms, however i'm looking for best blogs/ YT channels/ subreddits where i could learn specifics about web3 gaming.   \n\n\nEspecially I am interested in cross-chain solutions and projects implementing new ERC standards, however I will appreciate anything.   \n\n\nThanks! ",
            "author": "0xBBrainz",
            "title": "Where can i learn more about blockchain gaming?",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 10,
            "created": 1694782824.0,
            "num_comments": 10,
            "url": "https://www.reddit.com/r/ethereum/comments/16jcrnv/where_can_i_learn_more_about_blockchain_gaming/",
            "permalink": "/r/ethereum/comments/16jcrnv/where_can_i_learn_more_about_blockchain_gaming/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16jc7rx",
            "selftext": "I always have to foreword this by saying that, you need to do background research on the Foreign account taxation compliance act, known as Fatca. This is the main method america uses to force its banking laws, which encompass crypto, onto the rest of the world.\n\nThe second tool is Ofac and ctf/aml and Sanctions Regimes. But let's be honest, all of europe's adopted aml/ctf/kyc is simply what Washington told it to do, same goes for Japan, most other countries, their ctf/aml policy is ghost written by america, it's delivered from on high.\n\n\u0026amp;#x200B;\n\nThis is why TC got hit by the way, fatca, ofac are the main two prongs, the third prong is international cooperation with most UN law enforcement, so no one would protect Torn C\n\n\u0026amp;#x200B;\n\nRegardless of how you may feel about Ukraine or Taiwan, it is not DeFi's job to do the geopolitical bidding of america, it is not DeFi's job to destroy itself to appease peoples political goals. Those are not the only two countries being banned from crypto, and any new day america might add a new enemy to the long list it wants the world to financially exclude from the financial system.\n\n\u0026amp;#x200B;\n\nThe United States forced every other country to install strict KYC for forex, let that sink in, they forced every other country in the world to end anonymous broker and banks using the above political tools. \n\n\u0026amp;#x200B;\n\nThey have enough meta data to globally do \"geolocation address tainting and contamination\", they have enough ZachXBT's working for them to effectively mandate permissioning directly into smart contracts and multisig layer 2s. Those white list and black list exist.\n\n* \\-They can be used to debank you from crypto offramps and will be\n* \\-They can pass new laws where if you break your address history to use TC or monero, its a felony\n* \\-They can mandate these permissioned lists directly into smart contracts on Layer 2s\n* \\-They can absolutely and definitely will mandate any middle ware or front end with these address filters\n\n# -More importantly they will make a deemable list of Responsible Persons, encompassing most of the entire project development team, who are on a need to know basis of collecting Doxx information, anyone who doesn't put the white list filters on their frontends or backends, could conceivably be extradited and imprisoned \n\n* \\-They are basically saying in the 280 page Treasury Proposal they will force the above requirement on Validators and Sequencers and RPC Nodes and Relayers \n\n\u0026amp;#x200B;\n\nYes they can can catch us all because as the Bitcoin Samurai and Monero people taught us, you have address taint. The existence of address taint will be used to destroy DeFi globally. \n\n\u0026amp;#x200B;\n\nNow what is the more pragmatic outcome here?\n\nMy guess is the product market fit is so huge for crypto outside of america, that ultimately a lot of the companies end up running their DeFi products out of BRICS+ jurisdictions, and at least a third of all the smart contracts end up being on american Sanctions list, that is the conceivable outcome, because India's DeFi teams will not block Russians, and so forth, you will get a bifurcated system. \n\nLoosely permissioned automated finance on smart contracts will definitely take off, much like mobile payments exploded overseas outside of america. The Europeans will put tremendous amounts of middleware and permissioning on their fake faux DeFi of course, but it will be popular in Europe.\n\nI'm arguing that many developing and emerging markets will not use Nato backed and Washington backed aml guidelines, they will move to a system that allows them to take on most of these african countries and various other US sanction countries, including Russia, Ukraine, Syria so forth. \n\n\u0026amp;#x200B;\n\nDeFi itself will be hard banned in america, accessing any of the BRICS smart contracts will likely be a felony of some sort. Doing it via your own backend use of javascript or python may or may not be a felony, but I'm sure they'd like to do it.\n\n\u0026amp;#x200B;\n\nBut I want you to take a long deep pause here, and realize that your war mongering and american politics is what allowed the political climate to do this, the fixation on sanctioning Russia, proved Russia's theories about global banking relations correct, and it proved that these banking laws are really just extensions of Washington and Tradfi getting their rent seeking cut and monopolies.\n\nand indeed Russia Politics and DeFi are not compatible, they are not reconcilable. \n\n\u0026amp;#x200B;",
            "author": "samdane7777",
            "title": "DeFi Cannot Survive The Nato Sanctions Regime Political Status Quo",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 8,
            "created": 1694781430.0,
            "num_comments": 6,
            "url": "https://www.reddit.com/r/ethereum/comments/16jc7rx/defi_cannot_survive_the_nato_sanctions_regime/",
            "permalink": "/r/ethereum/comments/16jc7rx/defi_cannot_survive_the_nato_sanctions_regime/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16ishuk",
            "selftext": "",
            "author": "abcoathup",
            "title": "Recap of All Core Devs - Execution (ACDE) call by Tim Beiko; Screenshot from Eth R\u0026amp;D Discord",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 49,
            "created": 1694722205.0,
            "num_comments": 4,
            "url": "https://i.redd.it/rodyowt53aob1.png",
            "permalink": "/r/ethereum/comments/16ishuk/recap_of_all_core_devs_execution_acde_call_by_tim/",
            "comments": null
          }
        },
        {
          "data": {
            "id": "16ih6yr",
            "selftext": " If you are playing a game it is by nature centralized from the developer, I don’t see why you would need a decentralized layer on top of a centralized game but maybe I’m ignorant?  \n\n\nfor some reason people keep pushing the blockchain gaming, just yesterday Zynga has sold out their free mint and the fp is 0.2ETH today. ",
            "author": "0xBBrainz",
            "title": "Explain to me how gaming needs web3 or a blockchain?",
            "subreddit_name_prefixed": "r/ethereum",
            "ups": 58,
            "created": 1694694679.0,
            "num_comments": 111,
            "url": "https://www.reddit.com/r/ethereum/comments/16ih6yr/explain_to_me_how_gaming_needs_web3_or_a/",
            "permalink": "/r/ethereum/comments/16ih6yr/explain_to_me_how_gaming_needs_web3_or_a/",
            "comments": null
          }
        }
      ]
    }
  }
}